import AlgoQuirks = require("../AlgoQuirks");

class Quirks extends AlgoQuirks<string[]> {
  public ingredientMaker() {
    return []
  }

  public main() {
    const nameListA = ["白洁","曹卓琛","岑理坤","陈福勇","陈亮宇","陈镘羽","陈潇","程立","程逸婷","邓锐","邓宇","丁建勇","方钰鑫","付冰","付翔宇","付贻琳","高悦","高壮","耿傲然","郭超","何思扬","胡红亮","胡怿","胡宇石","黄河清","黄寅","姜秋菊","李谧","李佩","李帅","李娴姝","李鑫","李偞婧","李之俏","李卓霖","李紫瑄","梁恩泽","梁晓辉","廖雅婷","林晨曦","林洁","林志炜","刘静妮","刘念琼","刘思平","刘洋","刘莹莹","龙妍","鲁洋","陆达","马蕊","马骁潇","孟驰","潘乐容","沈韵秋","宋晓语","孙君","孙玙","唐燕南","汪衍","王超奇","王岚","王绵","王嫱","王瑞华","王小溪","王晓鑫","王晔琼","吴宇同","武文棣","徐畅","许捷","严晓敏","杨昆波","杨璐","杨睿","杨雨菲","尹通","于成成","余妍","郁欣蕾","袁宁","张皓亮","张洋","赵菡清","赵可","赵坤弘","郑智中"]

    const nameListB = ["白洁","陈福勇","陈亮宇","陈潇","程立","程逸婷","邓锐","丁建勇","付冰","付翔宇","付贻琳","高悦","高壮","耿傲然","郭超","胡红亮","胡怿","黄河清","黄寅","姜秋菊","李谧","李佩","李帅","李娴姝","李鑫","李偞婧","李之俏","李紫瑄","廖雅婷","林晨曦","林志炜","刘念琼","刘洋","刘莹莹","龙妍","鲁洋","陆达","马骁潇","孟驰","沈韵秋","孙君","孙玙","唐燕南","汪衍","王超奇","王岚","王绵","王嫱","王瑞华","王小溪","王晓鑫","武文棣","徐畅","许捷","严晓敏","杨昆波","杨璐","杨睿","杨雨菲","尹通","于成成","余妍","袁宁","张皓亮","张洋","赵菡清","赵可","赵坤弘","郑智中"]

    const nameListAMinusNameListB = []

    for (const nameA of nameListA){
      if (nameListB.indexOf(nameA) < 0){
        nameListAMinusNameListB.push(nameA)
      }
    }

    console.log(nameListAMinusNameListB.join('\n'))

    return nameListAMinusNameListB

  }

  public reference() {
    return []
  }
}

const quirks = new Quirks();

quirks.main()
